testdata/IN_2023_02/fr-buz-without-documents_2023_02b.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xm="http://www.w3.org/2005/05/xmlmime" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    
  <soapenv:Body>
      
    <tarif:getQuote xmlns:allg="http://www.bipro.net/namespace/allgemein" xmlns:basis="http://www.bipro.net/namespace/basis" xmlns:dt="http://www.bipro.net/namespace/datentypen" xmlns:fragen="http://www.bipro.net/namespace/fragen" xmlns:gevo="http://www.bipro.net/namespace/gevo" xmlns:kapanl-basis="http://www.bipro.net/namespace/kapitalanlage/basis" xmlns:nachr="http://www.bipro.net/namespace/nachrichten" xmlns:partner="http://www.bipro.net/namespace/partner" xmlns:pm="http://www.bipro.net/namespace/produktmodell" xmlns:pm-leben="http://www.bipro.net/namespace/versicherung/produktmodell/leben" xmlns:tarif="http://www.bipro.net/namespace/versicherung/tarifierung" xmlns:vb-leben="urn:de:vb:bipro:taa:leben:1.12" xmlns:vbl="urn:de:vb:bipro:taa:vbl:1.12" xmlns:vs-pm="http://www.bipro.net/namespace/versicherung/produktmodell" xmlns:xmime="http://www.w3.org/2005/05/xmlmime">
         
      <tarif:Request>
              
        <nachr:BiPROVersion>2.4.6.1.12</nachr:BiPROVersion>
        <nachr:ConsumerID>WS DEV TEAM</nachr:ConsumerID>
              
        <tarif:Tarifierung>
                   
          <gevo:Vermittler>
                        
            <allg:PartnerID>792002615</allg:PartnerID>
                        
            <allg:Vermittlerrolle>
                             
              <allg:ArtID>01</allg:ArtID>
                             
              <allg:Vermittlertyp>01</allg:Vermittlertyp>
                          
            </allg:Vermittlerrolle>
                     
          </gevo:Vermittler>
                   
          <tarif:Partner xsi:type="partner:CT_JuristischePerson">
                        
            <partner:PartnerID>792002615</partner:PartnerID>
                     
          </tarif:Partner>
                   
          <tarif:Partner xsi:type="partner:CT_Person">
                        
            <basis:Erweiterung xsi:type="vb-leben:CT_PersonErweiterung"/>
                        
            <partner:Anrede>1</partner:Anrede>
                        
            <partner:PartnerID>658492219</partner:PartnerID>
                        
            <partner:Anschrift>
                             
              <allg:Landname>Deutschland</allg:Landname>
                             
              <partner:ArtID>1</partner:ArtID>
                          
            </partner:Anschrift>
                        
            <partner:ZusaetzlichePartnerdaten xsi:type="pm-leben:CT_Risiko">
                             
              <pm-leben:Nichtraucher>true</pm-leben:Nichtraucher>
                          
            </partner:ZusaetzlichePartnerdaten>
                        
            <partner:ZusaetzlichePartnerdaten xsi:type="pm-leben:CT_Risikopruefung">
                             
              <pm-leben:Fragenkomplex>
                                  
                <fragen:ArtID xsi:type="dt:STE_FragenkomplexArtBasis">Gesundheit</fragen:ArtID>
                                  
                <fragen:Bezeichnung>Gesundheitsfragen zur versicherten Person</fragen:Bezeichnung>
                                  
                <fragen:Element xsi:type="fragen:CT_FrageJaNein">
                                       
                  <fragen:Ordnungsnummer>2349</fragen:Ordnungsnummer>
                                       
                  <fragen:FachlicheID>A25</fragen:FachlicheID>
                                       
                  <fragen:TechnischeID>VP.A25</fragen:TechnischeID>
                                       
                  <fragen:Text>Haben Sie in den letzten 12 Monaten aktiv Nikotin durch Rauchen oder Inhalieren zu sich genommen (z. B. über Zigaretten, Zigarren, Pfeifen, Shishas, E-Zigaretten, E-Zigarren, E-Pfeifen, E-Shishas)?</fragen:Text>
                                       
                  <fragen:FreitextErlaubt>false</fragen:FreitextErlaubt>
                                       
                  <fragen:AntwortJaNein>
                                            
                    <fragen:Entscheidung>false</fragen:Entscheidung>
                                         
                  </fragen:AntwortJaNein>
                                    
                </fragen:Element>
                               
              </pm-leben:Fragenkomplex>
                          
            </partner:ZusaetzlichePartnerdaten>
                        
            <partner:Geburtsdatum>2000-01-01</partner:Geburtsdatum>
                        
            <partner:Geschlecht>1</partner:Geschlecht>
                        
            <partner:Berufstaetigkeit>
                             
              <partner:Beruf>Maurer</partner:Beruf>
                             
              <partner:StellungImBeruf xsi:type="dt:STE_StellungImBerufBasis">01</partner:StellungImBeruf>
                          
            </partner:Berufstaetigkeit>
                     
          </tarif:Partner>
                   
          <tarif:Versicherungsnehmer>
                        
            <partner:PartnerID>658492219</partner:PartnerID>
                     
          </tarif:Versicherungsnehmer>
                   
          <tarif:Verkaufsprodukt>
                        
            <basis:Erweiterung xsi:type="vb-leben:CT_VerkaufsproduktErweiterung">
                             
              <vb-leben:OekoRenta>false</vb-leben:OekoRenta>
                             
              <vb-leben:Konsortium>Ohne</vb-leben:Konsortium>
                             
              <vb-leben:Next>false</vb-leben:Next>
                          
            </basis:Erweiterung>
                        
            <pm:Produkt xsi:type="pm-leben:CT_Produkt">
                             
              <basis:Erweiterung xsi:type="vb-leben:CT_ProduktErweiterung">
                                  
                <vb-leben:Tarifgruppe>Normal</vb-leben:Tarifgruppe>
                                  
                <vb-leben:Beitragsrendite>
                                       
                  <vb-leben:Fondskostenberuecksichtigungsart>PAUSCHAL</vb-leben:Fondskostenberuecksichtigungsart>
                                       
                  <vb-leben:Fondskostenberuecksichtigung>false</vb-leben:Fondskostenberuecksichtigung>
                                    
                </vb-leben:Beitragsrendite>
                               
              </basis:Erweiterung>
                             
              <pm:GewuenschteZahlungsweise>8</pm:GewuenschteZahlungsweise>
                             
              <pm:Beitrag>
                                  
                <pm:ArtID xsi:type="dt:STE_BeitragBasis">01</pm:ArtID>
                                  
                <pm:Betrag>
                                       
                  <allg:Betrag>300</allg:Betrag>
                                       
                  <allg:Waehrung>EUR</allg:Waehrung>
                                    
                </pm:Betrag>
                                  
                <pm:Zahlungsweise>8</pm:Zahlungsweise>
                               
              </pm:Beitrag>
                             
              <pm:Versicherungsdauer>
                                  
                <allg:Beginn>2023-03-01T12:00</allg:Beginn>
                               
              </pm:Versicherungsdauer>
                             
              <pm:Kennung>FR</pm:Kennung>
                             
              <pm:Elementarprodukt xsi:type="pm-leben:CT_Rente">
                                  
                <basis:Erweiterung xsi:type="vb-leben:CT_RenteErweiterung">
                                       
                  <vb-leben:Sicherheitskonzept>false</vb-leben:Sicherheitskonzept>
                                       
                  <vb-leben:Ablaufmanagement>
                                            
                    <allg:AnzahlJahre>5</allg:AnzahlJahre>
                                            
                    <allg:AnzahlMonate>0</allg:AnzahlMonate>
                                         
                  </vb-leben:Ablaufmanagement>
                                       
                  <vb-leben:TodesfallleistungImBezug>Restkapital</vb-leben:TodesfallleistungImBezug>
                                       
                  <vb-leben:FondsrenteDaten>
                                            
                    <vb-leben:ErhoehterTodesfallschutz>false</vb-leben:ErhoehterTodesfallschutz>
                                         
                  </vb-leben:FondsrenteDaten>
                                    
                </basis:Erweiterung>
                                  
                <pm:Versicherungsdauer>
                                       
                  <allg:AnzahlJahre>44</allg:AnzahlJahre>
                                       
                  <allg:AnzahlMonate>5</allg:AnzahlMonate>
                                    
                </pm:Versicherungsdauer>
                                  
                <pm:Dynamik>
                                       
                  <basis:Erweiterung xsi:type="vb-leben:CT_DynamikErweiterung">
                                            
                    <vb-leben:Art>TodesUndErlebensfall</vb-leben:Art>
                                         
                  </basis:Erweiterung>
                                       
                  <pm:ArtID xsi:type="dt:STE_DynamikBasis">05</pm:ArtID>
                                       
                  <pm:Frequenz xsi:type="dt:STE_FrequenzBasis">jaehrlich</pm:Frequenz>
                                       
                  <pm:KategorieID>Beitrag</pm:KategorieID>
                                    
                </pm:Dynamik>
                                  
                <vs-pm:VersicherungssummeOderLeistung>
                                       
                  <vs-pm:ArtID xsi:type="dt:STE_VersicherungssummeOderLeistungBasis">GarantierteRente</vs-pm:ArtID>
                                       
                  <vs-pm:Wertschluessel xsi:type="vb-leben:STE_LeistungSchluesselErweitert">Klassisch</vs-pm:Wertschluessel>
                                       
                  <vs-pm:Werteinheit>20</vs-pm:Werteinheit>
                                       
                  <vs-pm:Waehrung>EUR</vs-pm:Waehrung>
                                       
                  <vs-pm:Auszahlungsweise>8</vs-pm:Auszahlungsweise>
                                    
                </vs-pm:VersicherungssummeOderLeistung>
                                  
                <vs-pm:FondsPortfolio>
                                       
                  <vs-pm:Phase>Ablaufphase</vs-pm:Phase>
                                       
                  <vs-pm:FondsAnteil>
                                            
                    <kapanl-basis:ISIN>LU0006344922</kapanl-basis:ISIN>
                                            
                    <vs-pm:Garantiefonds>false</vs-pm:Garantiefonds>
                                            
                    <vs-pm:Prozentsatz>100.0</vs-pm:Prozentsatz>
                                         
                  </vs-pm:FondsAnteil>
                                    
                </vs-pm:FondsPortfolio>
                                  
                <vs-pm:Bezugsrecht>
                                       
                  <vs-pm:Leistungsfall>Erlebensfall</vs-pm:Leistungsfall>
                                       
                  <vs-pm:IndexBerechtigter>1</vs-pm:IndexBerechtigter>
                                    
                </vs-pm:Bezugsrecht>
                                  
                <vs-pm:Bezugsrecht>
                                       
                  <vs-pm:Leistungsfall>Todesfall</vs-pm:Leistungsfall>
                                       
                  <vs-pm:IndexBerechtigter>3</vs-pm:IndexBerechtigter>
                                    
                </vs-pm:Bezugsrecht>
                                  
                <pm-leben:Hochrechnungszins>6</pm-leben:Hochrechnungszins>
                                  
                <pm-leben:IstHauptversicherung>true</pm-leben:IstHauptversicherung>
                                  
                <pm-leben:UeberschussverwendungNachLeistung xsi:type="dt:STE_UeberschussverwendungBasis">14</pm-leben:UeberschussverwendungNachLeistung>
                                  
                <pm-leben:UeberschussverwendungVorLeistung xsi:type="dt:STE_UeberschussverwendungBasis">12</pm-leben:UeberschussverwendungVorLeistung>
                                  
                <pm-leben:VersichertePerson>
                                       
                  <partner:PartnerID>658492219</partner:PartnerID>
                                    
                </pm-leben:VersichertePerson>
                                  
                <pm-leben:BeitragsRueckgewaehrBeiTod>01</pm-leben:BeitragsRueckgewaehrBeiTod>
                                  
                <pm-leben:BeitragsRueckgewaehrBeiAblauf>false</pm-leben:BeitragsRueckgewaehrBeiAblauf>
                                  
                <pm-leben:Ablaufmanagement>true</pm-leben:Ablaufmanagement>
                               
              </pm:Elementarprodukt>
                             
              <pm:Elementarprodukt xsi:type="pm-leben:CT_ArbeitskraftAbsicherung">
                                  
                <basis:Erweiterung xsi:type="vb-leben:CT_ArbeitskraftAbsicherungErweiterung">
                                       
                  <vb-leben:NachversicherungsgarantieBU>0.0</vb-leben:NachversicherungsgarantieBU>
                                       
                  <vb-leben:Antragsdaten>
                                            
                    <vb-leben:NichtEUStaatsangehoeriger>false</vb-leben:NichtEUStaatsangehoeriger>
                                         
                  </vb-leben:Antragsdaten>
                                    
                </basis:Erweiterung>
                                  
                <vs-pm:VersicherungssummeOderLeistung>
                                       
                  <vs-pm:ArtID xsi:type="dt:STE_VersicherungssummeOderLeistungBasis">GarantierteRente</vs-pm:ArtID>
                                       
                  <vs-pm:Werteinheit>20</vs-pm:Werteinheit>
                                       
                  <vs-pm:Waehrung>EUR</vs-pm:Waehrung>
                                       
                  <vs-pm:Auszahlungsweise>8</vs-pm:Auszahlungsweise>
                                    
                </vs-pm:VersicherungssummeOderLeistung>
                                  
                <pm-leben:IstHauptversicherung>false</pm-leben:IstHauptversicherung>
                                  
                <pm-leben:UeberschussverwendungVorLeistung xsi:type="vb-leben:STE_UeberschussverwendungErweitert">WieHauptversicherung</pm-leben:UeberschussverwendungVorLeistung>
                                  
                <pm-leben:VersichertePerson>
                                       
                  <partner:PartnerID>658492219</partner:PartnerID>
                                    
                </pm-leben:VersichertePerson>
                                  
                <pm-leben:Art xsi:type="dt:STE_UnfaehigkeitsZusatzArtBasis">Beitragsbefreiung</pm-leben:Art>
                                  
                <pm-leben:Auspraegung xsi:type="dt:STE_UnfaehigkeitsZusatzAuspraegungBasis">BU</pm-leben:Auspraegung>
                                  
                <pm-leben:DynamisierungDerHauptversicherungImLeistungsfall>false</pm-leben:DynamisierungDerHauptversicherungImLeistungsfall>
                               
              </pm:Elementarprodukt>
                             
              <pm:Elementarprodukt xsi:type="pm-leben:CT_PflegeAbsicherung">
                                  
                <pm:Kennung>Rente PLUS</pm:Kennung>
                                  
                <pm-leben:IstHauptversicherung>false</pm-leben:IstHauptversicherung>
                                  
                <pm-leben:VersichertePerson>
                                       
                  <partner:PartnerID>658492219</partner:PartnerID>
                                    
                </pm-leben:VersichertePerson>
                               
              </pm:Elementarprodukt>
                             
              <pm:Dynamik>
                                  
                <pm:KategorieID>Beitrag</pm:KategorieID>
                                  
                <pm:Hochrechnung>true</pm:Hochrechnung>
                               
              </pm:Dynamik>
                             
              <pm-leben:VorgabeBerechnung>
                                  
                <pm-leben:ArtID xsi:type="dt:STE_VorgabeBerechnungBasis">Bruttobeitrag</pm-leben:ArtID>
                                  
                <pm-leben:Kontext xsi:type="dt:STE_VorgabeBerechnungKontextBasis">Produkt</pm-leben:Kontext>
                               
              </pm-leben:VorgabeBerechnung>
                          
            </pm:Produkt>
                     
          </tarif:Verkaufsprodukt>
                
        </tarif:Tarifierung>
           
      </tarif:Request>
      
    </tarif:getQuote>
      
  </soapenv:Body>
  
</soapenv:Envelope>
